app/controllers/school_classes_controller.rb

  def update
    @school_class.update(strong_params)
---
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 334], ["updated_at", "2020-02-25 21:17:52.018158"], ["id", 9]]

  def create
    @school_class = SchoolClass.create(strong_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "wecwec"], ["room_number", 1334], ["created_at", "2020-02-25 21:17:32.788442"], ["updated_at", "2020-02-25 21:17:32.788442"]]

  def destroy
    @school_class.destroy
---
DELETE FROM "school_classes" WHERE "school_classes"."id" = ?  [["id", 2]]