app/controllers/students_controller.rb

  def create
    student = Student.create(strong_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Marge"], ["last_name", "Simpson"], ["created_at", "2020-02-25 20:48:12.988158"], ["updated_at", "2020-02-25 20:48:12.988158"]]

  def update
    @student.update(strong_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Marge"], ["last_name", "Simpson"], ["updated_at", "2020-02-25 20:43:57.988126"], ["id", 2]]

  def destroy
    @student.destroy
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]